# This is a simple Brewfile for all of the packages I like to keep for my MacOS installs

# Brew Apps
brew "ansible"
brew "python"
brew "watch"
brew "tmux"
brew "zsh"
brew "neovim"
brew "fastfetch"
brew "zsh-git-prompt"
brew "stow"
brew "colima"
brew "docker"
brew "docker-compose"
brew "docker-buildx"
brew "docker-credential-helper"
brew "libvirt", restart_service: :changed
brew "qemu"
brew "tree"
brew "uv"
brew "socat"
brew "gh"
brew "spice-gtk"
brew "pkg-config"

# Casks (GUI Apps)
cask "ghostty"
cask "vscodium"
cask "spotify"
cask "ultimaker-cura"

# Stuff I'm forced to have for work...
cask "visual-studio-code"
cask "postman"
cask "1password"
cask "logi-options+"
cask "wireshark-app"
cask "microsoft-edge"
